Autodesk.Revit.DB.Fabrication.FabricationUtils.CreateFabricationJob(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String,System.Boolean)
saves passed fabrication parts in a the native fabrication archived job (ESJ) format.
ids:
list of FabricationPart element Ids, non-fabrication parts are ignored.
filename:
filename is used for the job file name.
addHolesForTaps:
addHolesForTaps set to have holes for taps on straights added to the created fabrication job.
Returns:
returns the number of fabrication parts created in the job, returns zero if no valid fabrication parts or unable to create the file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Fabrication.FabricationUtils.CreateFabricationJob(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String)
saves passed fabrication parts in a the native fabrication archived job (ESJ) format.
ids:
list of FabricationPart element Ids, non-fabrication parts are ignored.
filename:
filename is used for the job file name.
Returns:
returns the number of fabrication parts created in the job, returns zero if no valid fabrication parts or unable to create the file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Fabrication.FabricationUtils.ExportToMAJ(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId}@)
Exports a list of fabrication parts into the native fabrication job (MAJ) format.
document:
The document.
ids:
An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename:
The name given to the output file.
addHolesForTaps:
Set true to have holes for taps on straights added to the created fabrication job.
idsNotExported:
An array of element identifiers that were not included in the export.
Returns:
Returns the number of fabrication parts creatged in the export. Returns zero if no valid fabrication parts or unable to create the file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1